trunk/fireFoam/testBatteryFireFOAM/wallSuppression/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        //type            empty;
        type            cyclic;
    }
    ".*"
    {
        type            MarshakRadiation;
        T               T;
        emissivity      1;
        value           uniform 0;
        refValue	uniform 0;
        refGradient	uniform 0;
        valueFraction	uniform 0;
    }

    region0_to_filmRegion_wallFilmFaces
    {
        type            MarshakRadiation;
        T               T;
        //emissivity      0.17;
        emissivity      0.85;
        value           uniform 0;
        refValue    uniform 0;
        refGradient uniform 0;
        valueFraction   uniform 0;
    }
    region0_to_pyrolysisRegion_coupledWall
    {
        type            MarshakRadiation;
        T               T;
        //emissivity      0.17;
        emissivity      0.85;
        value           uniform 0;
        refValue    uniform 0;
        refGradient uniform 0;
        valueFraction   uniform 0;
    }
}

// ************************************************************************* //
