trunk/fireFoam/testBatteryFireFOAM/wallSuppression/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall           
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet         
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    } 

    ground          
    {
        type            fixedValue;
        value           $internalField;
    }

    side          
    {
        type            pressureInletOutletVelocity;
        phi		phi;
        value           $internalField;
    }

    sides
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            cyclic;
    }

    burner          
    {
        type            timeVaryingFlowRateInletVelocity;
        fileName        "$FOAM_CASE/constant/massFlowRateVsTime";
        value           uniform (0 0 0);
        outOfBounds     clamp;           // (error|warn|clamp|repeat)

        //type            flowRateInletVelocity;
        //flowRate        0.001714;     //30kW  CH2O
        //flowRate        0.0006;     //30kW  CH4
        flowRate        0.0060;     //150kW  CH4
        value           uniform (0 0 0);
    }
    region0_to_pyrolysisRegion_coupledWall
    {
        //type            flowRateInletVelocityCoupled;
        type            flowRateInletVelocityFuelConvertCoupled;
        phi             phi;
        nbrPhi          phiGas;
        rho             rho;
        hocPyr          1.765e7;  //heat of combustion per unit of pyrolysate, need to be converted from hoc per unit of virgin solid material 
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
