trunk/fireFoam/testBatteryFireFOAM/wallSuppression/0/filmRegion/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/filmRegion";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform  (0 0 0);

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall
    {
        type            directMappedFixedInternalValue;
        average         (0 0 0);
        setAverage      no;
        value           uniform (0 0 0);
    }

    side1
    {
        type            zeroGradient;
    }

    side2
    {
        type            zeroGradient;
    }

    side3 //top
    {
        type            zeroGradient;
    }

    side4
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
