trunk/fireFoam/testBatteryFireFOAM/wallSuppression/0/fu
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          fu;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall           
    {
        type            zeroGradient;
    }

    outlet      
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground           
    {
        type            zeroGradient;
    }

    "(side.*)"          
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    frontAndBack
    {
        //type            empty;
        type            cyclic;
    }

    burner          
    {
        //type            fixedValue;
        //value           uniform 1;
        type                totalFlowRateAdvectiveDiffusive;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
    }

    region0_to_filmRegion_wallFilmFaces
    {
        type                totalFlowRateAdvectiveDiffusive;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
    }
    region0_to_pyrolysisRegion_coupledWall
    {
        type                totalFlowRateAdvectiveDiffusive;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
    }


}


// ************************************************************************* //
