trunk/fireFoam/testBatteryFireFOAM/wallSuppression/0/pyrolysisRegion/Qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.com               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall_side
    {
        type            empty;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
//        type            directMappedField;
//        sampleRegion    region0;
//        sampleMode      nearestPatchFace;
//        samplePatch     region0_to_pyrolysisRegion_coupledWall;
//        offset          (0 0 0);
//        fieldName       Qr;
//        setAverage      no;
//        average         0;
//        value           uniform 0;
        type            directMappedField;
        sampleRegion    filmRegion;
        sampleMode      nearestPatchFace;
        samplePatch     coupledWall;
        offset          (0 0 0);
        fieldName       QrNet; // this is the name of the field that is pulled from the film model
        setAverage      no;
        average         0;
        value           uniform 0;
    }
}


// ************************************************************************* //
