trunk/fireFoam/testBatteryFireFOAM/wallSuppression/0/pyrolysisRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.com               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/pyrolysisRegion";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall_side
    {
        type empty;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        //type          compressible::turbulentTemperatureCoupledBaffleMixed;
        //type          compressible::turbulentTemperatureRadiationCoupledMixed;
        //type          compressible::turbulentTemperatureRadiationQinCoupledMixed;
        type          compressible::turbulentTemperatureRadiationCoupledMixedST;
        neighbourFieldName T;
        K               K;
        neighbourFieldRadiativeName Qin;
        fieldRadiativeName none;
        value           uniform 298;
    }

}


// ************************************************************************* //
