trunk/fireFoam/testBatteryFireFOAM/wallSuppression/0/pyrolysisRegion/Yv
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/pyrolysisRegion";
    object      Yv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }
    region0_to_pyrolysisRegion_coupledWall
    {
        type            zeroGradient;
    }
    coupledWall_side
    {
        type empty;
    }
}


// ************************************************************************* //
