trunk/fireFoam/testBatteryFireFOAM/wallSuppression/constant/massFlowRateVsTime
(
    (0  0.006)
    (1  0.006)
    (10 0)
)
