trunk/fireFoam/testBatteryFireFOAM/wallSuppression/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    // Correct constant/polyMesh/boundary dictionary after blockMesh.
    boundary
    {
        sides
        {
            type cyclic;
        }
//        frontAndBack
//        {
//            type cyclic;
//        }
    }
}

// ************************************************************************* //
